---
title: DuctPressureDropData
classe: Autodesk.Revit.DB.Mechanical.DuctPressureDropData
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 20
---

# DuctPressureDropData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CategoryId { get; }` | `ductPressureDropData.CategoryId` | ElementId |
| `Double Coefficient { get; set; }` | `ductPressureDropData.Coefficient` | Double |
| `Double Density { get; }` | `ductPressureDropData.Density` | Double |
| `Double DynamicViscosity { get; }` | `ductPressureDropData.DynamicViscosity` | Double |
| `Double Flow { get; }` | `ductPressureDropData.Flow` | Double |
| `Double Friction { get; set; }` | `ductPressureDropData.Friction` | Double |
| `Double Height { get; }` | `ductPressureDropData.Height` | Double |
| `Double HydraulicDiameter { get; set; }` | `ductPressureDropData.HydraulicDiameter` | Double |
| `Boolean IsValidObject { get; }` | `ductPressureDropData.IsValidObject` | Boolean |
| `Double Length { get; }` | `ductPressureDropData.Length` | Double |
| `SystemCalculationLevel Level { get; }` | `ductPressureDropData.Level` | SystemCalculationLevel |
| `Double PressureDrop { get; set; }` | `ductPressureDropData.PressureDrop` | Double |
| `Double ReynoldsNumber { get; set; }` | `ductPressureDropData.ReynoldsNumber` | Double |
| `Double Roughness { get; }` | `ductPressureDropData.Roughness` | Double |
| `ConnectorProfileType Shape { get; }` | `ductPressureDropData.Shape` | ConnectorProfileType |
| `Double Velocity { get; set; }` | `ductPressureDropData.Velocity` | Double |
| `Double VelocityPressure { get; set; }` | `ductPressureDropData.VelocityPressure` | Double |
| `Double Viscosity { get; }` | `ductPressureDropData.Viscosity` | Double |
| `Double WidthOrDiameter { get; }` | `ductPressureDropData.WidthOrDiameter` | Double |
| `Void Dispose()` | `ductPressureDropData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```